Documents/ТелеграмСообщенияВходящие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Document>
		<Properties>
			<Name>ТелеграмСообщенияВходящие</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ТелеграмСообщения</xr:Item>
				<xr:Item>AccumulationRegister.ТелеграмСообщенияГруппыСообщений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>update_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщениеИД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелеграмКонтакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмКонтакты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СодержаниеСообщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИДРодителя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СодержаниеЗапросаОбратногоВызова</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИДРодителя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ТелеграмСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмСообщения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелеграмКонтакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмКонтакты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТелеграмСообщенияИсходящие</v8:Type>
						<v8:Type>cfg:DocumentRef.ТелеграмСообщенияВходящие</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТелеграмГруппыСообщенийСостояние.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмГруппыСообщенийСостояние</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Открыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТелеграмГруппаСообщений</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТелеграмГруппыСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТелеграмСообщенияГруппыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<AccumulationRegister>
		<Properties>
			<Name>ТелеграмСообщенияГруппыСообщений</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТелеграмГруппаСообщений</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТелеграмГруппыСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипВложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ТелеграмСообщенияВходящие/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ТелеграмСообщения.Записывать = Истина;
	ДвижениеРСТС = Движения.ТелеграмСообщения.Добавить();
	ДвижениеРСТС.ДатаСообщения = Дата;
	ДвижениеРСТС.Сообщение = Ссылка;
	ДвижениеРСТС.Текст = Текст;
	ДвижениеРСТС.ТелеграмКонтакт = ТелеграмКонтакт;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТелеграмГруппыСообщенийСостояниеСрезПоследних.ТелеграмГруппаСообщений
	               |ИЗ
	               |	РегистрСведений.ТелеграмГруппыСообщенийСостояние.СрезПоследних(&Период, ТелеграмГруппаСообщений.ТелеграмКонтакт = &ТелеграмКонтакт) КАК ТелеграмГруппыСообщенийСостояниеСрезПоследних
	               |ГДЕ
	               |	ТелеграмГруппыСообщенийСостояниеСрезПоследних.Открыта
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТелеграмГруппыСообщенийСостояниеСрезПоследних.Период УБЫВ";
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ТелеграмКонтакт", ТелеграмКонтакт);
	Результат = Запрос.Выполнить();	
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();	
		Пока Выборка.Следующий() Цикл			
			Движения.ТелеграмСообщенияГруппыСообщений.Записывать = Истина;
			Вложения = ОпределитьТипыИКоличествоВложений();
			Для Каждого Вложение Из Вложения Цикл
				ДвижениеРНТСГС = Движения.ТелеграмСообщенияГруппыСообщений.Добавить();
				ДвижениеРНТСГС.Период = Дата;
				ДвижениеРНТСГС.ТелеграмГруппаСообщений = Выборка.ТелеграмГруппаСообщений;
			    ДвижениеРНТСГС.ТипВложения = Вложение.Тип;
				ДвижениеРНТСГС.Количество = Вложение.Количество;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьТипыИКоличествоВложений()
	
	Ответ = Новый ТаблицаЗначений();
	Ответ.Колонки.Добавить("Тип", Новый ОписаниеТипов("Строка"));
	Ответ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	СтрокиПервогоУровня = СодержаниеСообщения.НайтиСтроки(Новый Структура("ИДРодителя", 0));
	Для Каждого Строка Из СтрокиПервогоУровня Цикл
		Если Строка.Ключ = "text" Тогда
			нСтрОтвет = Ответ.Добавить();
			нСтрОтвет.Тип = "text";
			нСтрОтвет.Количество = 1;			
		КонецЕсли;		
		Если Строка.Ключ = "photo" Тогда
			нСтрОтвет = Ответ.Добавить();
			нСтрОтвет.Тип = "photo";
			нСтрОтвет.Количество = 1;			
		КонецЕсли;	
		Если Строка.Ключ = "video" Тогда
			нСтрОтвет = Ответ.Добавить();
			нСтрОтвет.Тип = "video";
			нСтрОтвет.Количество = 1;			
		КонецЕсли;	
		Если Строка.Ключ = "document" Тогда
			нСтрОтвет = Ответ.Добавить();
			нСтрОтвет.Тип = "document";
			нСтрОтвет.Количество = 1;			
		КонецЕсли;	
		Если Строка.Ключ = "audio" Тогда
			нСтрОтвет = Ответ.Добавить();
			нСтрОтвет.Тип = "audio";
			нСтрОтвет.Количество = 1;			
		КонецЕсли;	
		Если Строка.Ключ = "voice" Тогда
			нСтрОтвет = Ответ.Добавить();
			нСтрОтвет.Тип = "voice";
			нСтрОтвет.Количество = 1;			
		КонецЕсли;
		Если Строка.Ключ = "sticker" Тогда
			нСтрОтвет = Ответ.Добавить();
			нСтрОтвет.Тип = "sticker";
			нСтрОтвет.Количество = 1;			
		КонецЕсли;
	КонецЦикла;
	
	Ответ.Свернуть("Тип", "Количество");
	
	Возврат Ответ;
	
КонецФункции
